artillery/artillery.yml
config:
  target: "http://172.23.0.220/"
#  target: "http://167.172.244.128:8080"
  phases:
    - duration: 10
      arrivalRate: 1
  payload:
    path: "form_values.csv"
    fields:
      - "name"
      - "rut"
      - "motive"
      - "address"
  environments:
    low:
      phases:
        - duration: 60
          arrivalRate: 2
          rampTo: 10
    medium:
      phases:
        - duration: 60
          arrivalRate: 5
          rampTo: 10
        - duration: 60
          arrivalRate: 10
    high:
      phases:
        - duration: 120
          arrivalRate: 10
          rampTo: 15
        - duration: 60
          arrivalRate: 15
          rampTo: 30
    stress:
      phases:
        - duration: 120
          arrivalRate: 30
        - duration: 120
          arrivalRate: 30
          rampTo: 60
scenarios:
  - name: "Fill and send form"
    flow:
      - get:
         url: "/"
      - think: 3
      - get:
         url: "/nuevo"
      - think: 10
      - post:
         url: "/api/create"
         json:
          name: "{{name}}"
          rut: "{{rut}}"
          motive: "{{motive}}"
          address: "{{address}}"
         capture:
          json: $.id
          as: "id"
      - think: 5
      - get:
         url: "/validar/{{ id }}"
         ifTrue: "id"